const quiz = {
    questions: [
        {
            q: "Вопрос первый: умеете ли пользоваться Figma?\n1. Да\t2. Не особо\t3. Нет",
            a: [3, 2, 1],
            type: "design",
        },
        {
            q: "Второй вопрос: что лучше ригбади или транспанирование?\n1. Ригбади\t2. Транспанирование\t3. Не знаю",
            a: [6, 3, 1],
            type: "gamedev",
        },
        {
            q: "Вопрос №3: знакомы ли вы с реактивностью в вебе?\n1. Да\t2. Не особо\t3. Нет",
            a: [3, 2, 1],
            type: "frontend",
        },
        {
            q: "Четвертый вопрос: для аналитики лучше подойдет Python или C#?\n1. Python\t2. C#\t3. Не знаю",
            a: [3, 1, 2],
            type: "analytics",
        },
        {
            q: "Вопрос пятый: понимаете ли вы разницу между рандом форест и кластеризацией?\n1. Да\t2. Не особо\t3. Нет",
            a: [3, 2, 1],
            type: "analytics",
        },
        {
            q: "Шестой вопрос: у вас есть опыт в написании интерфейсов?\n1. Да\t2. Не особо\t3. Нет",
            a: [3, 2, 1],
            type: "frontend",
        },
        {
            q: "Предпоследний вопрос: асинхронное программирование лучше синхронного?\n1. Да\t2. Нет",
            a: [6, 3, 1],
            type: "backend",
        },
        {
            q: "И филнальный вопрос: у вас есть дизайнерские способности?\n1. Да\t2. Не особо\t3. Нет",
            a: [3, 2, 1],
            type: "design",
        },
        null
    ],
};

module.exports = {quiz};
